TFXSLT_project/testdata/delivery.example.out1.tst

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:ns0="http://service.arno.com/MathServiceNoPolicy">
   <Body>
      <ns0:add>
         <ns0:a>100</ns0:a>
         <ns0:b>20</ns0:b>
      </ns0:add>
   </Body>
</Envelope>